import {IDataOneSectionView} from "../interfaces";

// имитация получения данных с сервера

export const data: IDataOneSectionView[] = [
    {
        id: 652,
        title: 'Наушники',
        value: 'headphones',
        devices: [
            {
                id: 0,
                deviceImage: '../../../public/0.svg',
                name: 'Apple BYZ S852I',
                range: 4.7,
                price: 3527,
                salePrice: 2927,
                description : [
                    {
                        title: 'Описание',
                        data: 'Наушники EarPods оснащены встроенным пультом, с помощью которого можно регулировать громкость, управлять воспроизведением музыки и видео и принимать или завершать звонки одним нажатием.'
                    },
                    {
                        title: 'Чувствительность',
                        data: '98 дБ'
                    },
                    {
                        title: 'Бренд',
                        data: 'Apple'
                    },
                    {
                        title: 'Тип конструкции',
                        data: 'вкладыши'
                    },
                    {
                        title: 'Тип соединения',
                        data: 'проводные'
                    },
                    {
                        title: 'Регулировка громкости',
                        data: 'есть'
                    }
                ]
            },
            {
                id: 1,
                deviceImage: '../../../public/1.svg',
                name: 'Apple EarPods',
                range: 4.5,
                price: 2327,
                salePrice: null,
                description : [
                    {
                        title: 'Описание',
                        data: 'Наушники EarPods оснащены встроенным пультом, с помощью которого можно регулировать громкость, управлять воспроизведением музыки и видео и принимать или завершать звонки одним нажатием.'
                    },
                    {
                        title: 'Чувствительность',
                        data: '98 дБ'
                    },
                    {
                        title: 'Бренд',
                        data: 'Apple'
                    },
                    {
                        title: 'Тип конструкции',
                        data: 'вкладыши'
                    },
                    {
                        title: 'Тип соединения',
                        data: 'проводные'
                    },
                    {
                        title: 'Регулировка громкости',
                        data: 'есть'
                    }
                ]
            },
            {
                id: 2,
                deviceImage: '../../../public/2.svg',
                name: 'Apple EarPods 2',
                range: 4.5,
                price: 2327,
                salePrice: 1999,
                description : [
                    {
                        title: 'Описание',
                        data: 'Наушники EarPods оснащены встроенным пультом, с помощью которого можно регулировать громкость, управлять воспроизведением музыки и видео и принимать или завершать звонки одним нажатием.'
                    },
                    {
                        title: 'Чувствительность',
                        data: '98 дБ'
                    },
                    {
                        title: 'Бренд',
                        data: 'Apple'
                    },
                    {
                        title: 'Тип конструкции',
                        data: 'вкладыши'
                    },
                    {
                        title: 'Тип соединения',
                        data: 'проводные'
                    },
                    {
                        title: 'Регулировка громкости',
                        data: 'есть'
                    }
                ]
            },
            {
                id: 3,
                deviceImage: '../../../public/3.svg',
                name: 'Apple BYZ S3562',
                range: 4.7,
                price: 3527,
                salePrice: null,
                description : [
                    {
                        title: 'Описание',
                        data: 'Наушники EarPods оснащены встроенным пультом, с помощью которого можно регулировать громкость, управлять воспроизведением музыки и видео и принимать или завершать звонки одним нажатием.'
                    },
                    {
                        title: 'Чувствительность',
                        data: '98 дБ'
                    },
                    {
                        title: 'Бренд',
                        data: 'Apple'
                    },
                    {
                        title: 'Тип конструкции',
                        data: 'вкладыши'
                    },
                    {
                        title: 'Тип соединения',
                        data: 'проводные'
                    },
                    {
                        title: 'Регулировка громкости',
                        data: 'есть'
                    }
                ]
            },
            {
                id: 4,
                deviceImage: '../../../public/4.svg',
                name: 'Apple EarPods 3',
                range: 4.5,
                price: 3325,
                salePrice: 2375,
                description : [
                    {
                        title: 'Описание',
                        data: 'Наушники EarPods оснащены встроенным пультом, с помощью которого можно регулировать громкость, управлять воспроизведением музыки и видео и принимать или завершать звонки одним нажатием.'
                    },
                    {
                        title: 'Чувствительность',
                        data: '98 дБ'
                    },
                    {
                        title: 'Бренд',
                        data: 'Apple'
                    },
                    {
                        title: 'Тип конструкции',
                        data: 'вкладыши'
                    },
                    {
                        title: 'Тип соединения',
                        data: 'проводные'
                    },
                    {
                        title: 'Регулировка громкости',
                        data: 'есть'
                    }
                ]
            },
            {
                id: 5,
                deviceImage: '../../../public/5.svg',
                name: 'Apple EarPods 6',
                range: 4.3,
                price: 2563,
                salePrice: null,
                description : [
                    {
                        title: 'Описание',
                        data: 'Наушники EarPods оснащены встроенным пультом, с помощью которого можно регулировать громкость, управлять воспроизведением музыки и видео и принимать или завершать звонки одним нажатием.'
                    },
                    {
                        title: 'Чувствительность',
                        data: '98 дБ'
                    },
                    {
                        title: 'Бренд',
                        data: 'Apple'
                    },
                    {
                        title: 'Тип конструкции',
                        data: 'вкладыши'
                    },
                    {
                        title: 'Тип соединения',
                        data: 'проводные'
                    },
                    {
                        title: 'Регулировка громкости',
                        data: 'есть'
                    }
                ]
            }
        ]
    },
    {
        id: 654,
        title: 'Беспроводные наушники',
        value: 'wireless_headphones',
        devices: [
            {
                id: 6,
                deviceImage: '../../../public/6.svg',
                name: 'Apple AirPods',
                range: 4.7,
                price: 9527,
                salePrice: null,
                description: [
                    {
                        title: 'Описание',
                        data: 'Сочетание тщательно продуманного дизайна, передовых технологий и кристально чистого звука. Благодаря чипу H1 могут работать в режиме телефонного разговора до 3 часов без подзарядки. Футляр заряжается через разъём Lightning. Двойное касание для начала или переключения на следующий трек. Серия 2019 г.',
                    },
                    {
                        title: 'Чувствительность',
                        data: '3,5 дБ'
                    },
                    {
                        title: 'Бренд',
                        data: 'Apple'
                    },
                    {
                        title: 'Тип конструкции',
                        data: 'вкладыши'
                    },
                    {
                        title: 'Тип соединения',
                        data: 'беспроводные bluetooth'
                    },
                    {
                        title: 'Регулировка громкости',
                        data: 'нет'
                    }
                ]
            },
            {
                id: 7,
                deviceImage: '../../../public/7.svg',
                name: 'GERLAX GH-04',
                range: 4.7,
                price: 6527,
                salePrice: null,
                description: [
                    {
                        title: 'Описание',
                        data: 'Наушники EarPods оснащены встроенным пультом, с помощью которого можно регулировать громкость, управлять воспроизведением музыки и видео и принимать или завершать звонки одним нажатием.',
                    },
                    {
                        title: 'Чувствительность',
                        data: '3,5 дБ'
                    },
                    {
                        title: 'Бренд',
                        data: 'Apple'
                    },
                    {
                        title: 'Тип конструкции',
                        data: 'внутриканальные'
                    },
                    {
                        title: 'Тип соединения',
                        data: 'беспроводные bluetooth'
                    },
                    {
                        title: 'Регулировка громкости',
                        data: 'есть'
                    }
                ]
            },
            {
                id: 8,
                deviceImage: '../../../public/8.svg',
                name: 'BOROFONE BO4',
                range: 4.7,
                price: 7527,
                salePrice: 6336,
                description: [
                    {
                        title: 'Описание',
                        data: 'Комфортные наушники мониторного типа, которые оснащены фирменной технологией воспроизведения басов XBS DEEP, они обеспечивают четкую и насыщенную передачу низких частот, для еще большего впечатления при прослушивании динамичной музыки.',
                    },
                    {
                        title: 'Чувствительность',
                        data: '100 дБ'
                    },
                    {
                        title: 'Бренд',
                        data: 'Borofone'
                    },
                    {
                        title: 'Тип конструкции',
                        data: 'мониторные'
                    },
                    {
                        title: 'Тип соединения',
                        data: 'беспроводные bluetooth'
                    },
                    {
                        title: 'Регулировка громкости',
                        data: 'есть'
                    }
                ]
            },
        ]
    }
]